TITLE = "Имитационное моделирование работы сборочного цеха"
ABOUT = "Компьютерная программа «Production Model» статистического моделирования линии сборки позволяет имитировать работу сборочного цеха, участка и рабочих мест по времени t на каждом шаге Δt"

######################### Настройки в интерфейсе #########################
TIME_TOTAL = int((8 * 60 * 60) / 10) #убрать деление на 10 после отладки
TIME_DELTA = 10
TOTAL_ITEARTIONS = 250
TOTAL_WORK_PLACES_FROM = 1
TOTAL_WORK_PLACES_TO = 100
###########################################################################

############################### random ###################################
RANDOM_INIT_NUM = 42
EXPONENT_LAMBDA = 1
GAUSS_MU = 1.0
GAUSS_SIGMA = 0.5
WEIBULL_ALPHA = 1.0
WEIBULL_BETA = 0.5
###########################################################################

###################### Конвейер production line ############################
TOTAL_WORK_PLACES = 10 #количество рабочих мест, обслуживаемых конвейером
TOTAL_PRODUCT_CREEATED = 0
PALLET_SIZE_X = 0.5
PALLET_SIZE_Y = 0.5
DENIAL_PROBABILITY_PL = 0.00001
SPEED = 0.5  #скорость конвейера в метрах в секунду
WORKER_PRODUCTIVITY = 0.02
###################################################

################### Рабочее место workplace #################
FINAL_STORE_SIZE = 1
INITIAL_STORE_SIZE = 1
DENIAL_PROBABILITY_W = 0.00001
# VEIBULA_MATH_EXPECTATION
#############################################################

##################### Накопитель store ######################
DENIAL_PROBABILITY_S = 0.00001
# VEIBULA_MATH_EXPECTATION
#############################################################